## Ways of creating dataframes using pandas

### 1) CSV file - pd.read_csv("*name of file*")
### 2) Excel file - pd.read_excel("*name of file*", "*name of sheet*")
### 3) Creating data frame from dictionary, list of dictionaries, list of tuples (see the course video for how-to)

## Reading Excel Files

In [9]:
import pandas as pd
df = pd.read_excel("7-4_stock_data.xlsx", "Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

### In case you need to skip the first row, you can use code:
header=1
### In case you don't have header names, you can use following code to supply headers:
header = None, names = ["","","",]
### If you want to limit the number of rows that are read, use:
nrows =
### cleaning up n/a values:

In [12]:
df = pd.read_excel("7-4_stock_data.xlsx", "Sheet1", na_values = ["not available", "n.a."])

In [11]:
df

  GOOGL  27.82   87     845     larry page
0   WMT   4.61  484    65.0            NaN
1  MSFT  -1.00   85    64.0     bill gates
2  RIL     NaN   50  1023.0  mukesh ambani
3  TATA   5.60   -1     NaN     ratan tata

### ^ you can also turn na_values into a dictionary in order to clean up multiple columns!
### another way of cleaning up null values is to use converters (it is a type of function!)

## Writing Excel Files

In [5]:
df.to_excel('new_stock_data.xlsx','sheet1')

### you can also write multiple worksheets to the same workbook.